"ERROR_PARSE_FILENOTFOUND"="It is not found any file specified for %s"
"ERROR_PARSE_OUTPUTPATH"="Invalid output file/path for %s"

"ERROR_IS7ZIP_FILESEEK"="Es gab einen Fehler bei der Positionierung des Filestreams im Modul IS7zipExtract!"
"ERROR_IS7ZIP_FILECREATE"="An error occurred creating a filestream%n%s%nin the module IS7zipExtract!"
"ERROR_IS7ZIP_FILEOPEN"="There was an error opening the filestream%n%s%nin the module IS7zipExtract!"
"ERROR_IS7ZIP_COLFILES"="Fehler bei der Ermittlung der Anzahl der Dateien im Archiv im Modul IS7zipExtract!"
"ERROR_IS7ZIP_NOTOPEN"="Öffnen des Archivs im Modul IS7zipExtract fehlgeschlagen!"
"ERROR_IS7ZIP_CORRUPT"="Fehler beim Extrahieren von Daten aus dem 7z-Archiv. Vielleicht ist es beschädigt!"
"ERROR_IS7ZIP_EXCEPT"="Fehler im Archiv oder ein unerwarteter Fehler im Modul IS7zipExtract!"

"ERROR_ISARC_LOADDLL"="Beim Laden von Unarc.dll ist ein Fehler aufgetreten!"

"ERROR_ISARC_GENERAL"="Beim Entpacken ist ein Fehler aufgetreten!%nUnarc.dll hat einen Fehlercode zurückgegeben: -1%n%s"
"ERROR_ISARC_INVALID_COMPRESSOR"="Beim Entpacken ist ein Fehler aufgetreten: Unbekannte Komprimierungsmethode!%nUnarc.dll hat einen Fehlercode zurückgegeben: -2%n%s"
"ERROR_ISARC_ONLY_DECOMPRESS"="Beim Entpacken ist ein Fehler aufgetreten!%nUnarc.dll hat einen Fehlercode zurückgegeben: -3%n%s"
"ERROR_ISARC_OUTBLOCK_TOO_SMALL"="Beim Entpacken ist ein Fehler aufgetreten: Output data block zu klein!%nUnarc.dll hat einen Fehlercode zurückgegeben: -4%n%s"
"ERROR_ISARC_NOT_ENOUGH_MEMORY"="Beim Entpacken ist ein Fehler aufgetreten: Nicht genug Speicher!%nUnarc.dll hat einen Fehlercode zurückgegeben: -5%n%s"
"ERROR_ISARC_READ"="Beim Entpacken ist ein Fehler aufgetreten: Daten konnten nicht gelesen werden!%nUnarc.dll hat einen Fehlercode zurückgegeben: -6%n%s"
"ERROR_ISARC_BAD_COMPRESSED_DATA"="Beim Entpacken ist ein Fehler aufgetreten: Archiv beschädigt!%nUnarc.dll hat einen Fehlercode zurückgegeben: -7%n%s"
"ERROR_ISARC_NOT_IMPLEMENTED"="Beim Entpacken ist ein Fehler aufgetreten: Erforderliche Funktionen werden von DLL nicht unterstützt!%nUnarc.dll hat einen Fehlercode zurückgegeben: -8%n%s"
"ERROR_ISARC_NO_MORE_DATA_REQUIRED"="Beim Entpacken ist ein Fehler aufgetreten: Die angeforderten Daten wurden extrahiert!%nUnarc.dll hat einen Fehlercode zurückgegeben: -9%n%s"
"ERROR_ISARC_WRITE"="Beim Entpacken ist ein Fehler aufgetreten: Daten konnten nicht auf die Festplatte geschrieben werden!%nUnarc.dll hat einen Fehlercode zurückgegeben: -11%n%s"
"ERROR_ISARC_BAD_CRC"="Beim Entpacken ist ein Fehler aufgetreten: Passt nicht zur Prüfsumme!%nUnarc.dll hat einen Fehlercode zurückgegeben: -12%n%s"
"ERROR_ISARC_BAD_PASSWORD"="Beim Dekomprimieren ist ein Fehler aufgetreten: Ungültiges Passwort!%nUnarc.dll hat einen Fehlercode zurückgegeben: -13%n%s"
"ERROR_ISARC_BAD_HEADERS"="Beim Dekomprimieren ist ein Fehler aufgetreten: Archiv-Header ist beschädigt!%nUnarc.dll hat einen Fehlercode zurückgegeben: -14%n%s"
"ERROR_ISARC_INTERNAL"="Beim Entpacken ist ein Fehler aufgetreten: Interner Fehler DLL!%nUnarc.dll hat einen Fehlercode zurückgegeben: -15%n%s"
"ERROR_ISARC_UNKNOWN"="eim Entpacken ist ein Fehler aufgetreten!%n%s"
"ERROR_ISARC_EXCEPT"="Fehler im Archiv oder ein unerwarteter Fehler im Modul ISArcExtract!"

"ERROR_ISPCF_CANT_OPEN_INFILE"="An error occurred accessing the input file%n%s%nin the module ISPrecompExtract"
"ERROR_ISPCF_ISNOTPCF"="Invalid format of PCF-File:%n%s"
"ERROR_ISPCF_UNKNOWN_VERSION"="Unknown version of PCF-file:%n%s"
"ERROR_ISPCF_ACCESS_TO_OUTFILE"="In module ISPrecompExtract it is not possible to get access to an output file:%n%s"
"ERROR_ISPCF_LAUNCH_PROC"="Error start of the console application %s"
"WARNING_ISPCF_OPEN_PROC"="Error at process opening in ISPrecompExtract.%nPerhaps the installer not authorized.%nProgress of some operations will not be available!"
"ERROR_ISPCF_CANT_FIND_OUTFILE"="File has not been created by the console application%n%s%nProbably error or incorrect format of a pcf-file"
"ERROR_ISPCF_EXCEPT"="An unexpected error in the module ISPrecompExtract!"

"ERROR_ISSREP_GENERAL"="There was an error in the module ISSrepExtract!%n%s"
"ERROR_ISSREP_ACCESS_TO_OUTFILE"="In the module ISSrepExtract can not access to the output file:%n%s"
"ERROR_ISSREP_EXCEPT"="An unexpected error in the module ISSrepExtract!"

"ERROR_ISRAR_MULTIVOLUME"="multipart .rar archives with the data on different disks are not supported!"
"ERROR_ISRAR_DLL_NOT_FOUND"="Unable to find DLL %s"
"ERROR_ISRAR_EXCEPT"="Error in archive or an unexpected error in the module ISRarExtract!"

"ERROR_M3PACK_ACCESS_TO_OUTFILE"="In module ISm3unpack it is not possible to get access to an output file:%n%s"
"ERROR_M3PACK_EXCEPT"="An unexpected error in the module ISm3unpack!"),

"ERROR_UNPACK_ACCESS_TO_OUTFILE"="In module ISUnpack it is not possible to get access to an output file:%n%s"
"ERROR_UNPACK_LAUNCH_PROC"="Error start of the console application in ISUnpack!"
"WARNING_UNPACK_OPEN_PROC"="Error at process opening in ISUnpack.%nPerhaps the installer not authorized.%nProgress of some operations will not be available!"
"ERROR_UNPACK_CANT_FIND_OUTFILE"="File has not been created by the console application%n%s%nMaybe an error or an incorrect format of unpack-file"
"ERROR_UNPACK_EXCEPT"="An unexpected error in the module ISUnpack!"

"ERROR_XDELTA_GENERAL"="There was an error of unpacking in the module ISxDeltaExtract!"
"ERROR_XDELTA_CANT_GET_MEM"="Error when allocating memory to perform operations in ISxDeltaExtract!"
"ERROR_XDELTA_DLL_NOT_FOUND"="Unable to find DLL %s"
"ERROR_XDELTA_ACCESS_TO_OUTFILE"="In module ISxDeltaExtract it is not possible to get access to an output file:%n%s"
"ERROR_XDELTA_EXCEPT"="An unexpected error in the module ISxDeltaExtract!"

"ERROR_PACKZIP_BAD_INFILE"="Invalid input path for ISPackZIP"
"ERROR_PACKZIP_BAD_OUTFILE"="Invalid output file for ISPackZIP"
"ERROR_PACKZIP_BAD_COMPRESSION_LVL"="The compression settings for ISPackZIP Should be in limits 0..9"
"ERROR_PACKZIP_ACCESS_TO_OUTFILE"="In module ISPackZIP it is not possible to get access to an output file:%n%s"
"ERROR_PACKZIP_LAUNCH_PROC"="Error start of the console application %s"
"WARNING_PACKZIP_OPEN_PROC"="Error at process opening in ISPackZIP.%nPerhaps the installer not authorized.%nProgress of some operations will not be available!"
"ERROR_PACKZIP_CANT_FIND_OUTFILE"="File has not been created by the console application%n%s%nIn module ISPackZIP"
"ERROR_PACKZIP_EXCEPT"="An unexpected error in the module ISPackZIP!"

"ERROR_INIT_LOW_MEM"="Not enough memory to unpack!%nTry to close all opened programs and then restart the installer"
"ERROR_INIT_CANT_GET_MEM"="Memory allocation error when initializing the DLL!"
"WARNING_INIT_SREP_BAD_PARAM"="When initializing srep specify a value no more 4096mb.%nTo not display this message, correct the compliant parameter."
"ERROR_INIT_PRECOMP_BAD_PARAM"="During initialization Precomp, incorrect version given!"

"ERROR_FINFILES_EXCEPT"="An unexpected error in the module ISFindFiles!"
"ERROR_PICKFILE_EXCEPT"="An unexpected error in the module ISPickFilename!"
"ERROR_EXEC_LAUNCH_PROC"="Start error%n%s%nin the module ISExec!"
"ERROR_EXEC_EXCEPT"="An unexpected error in the module ISExec!"

"CHANGE_DISK_TITLE"="Setup needs the next disk"
"CHANGE_DISK_LABEL"="If the files on this disk can be found in a folder other than the one displayed below, enter the correct path or click Browse"
"BROWSE_TITLE"="Browse"
"BROWSE_LABEL"="Please specify the path to the next disc"
"BUTTON_OK"="OK"
"BUTTON_CANCEL"="Cancel"
"BUTTON_BROWSE"="Browse..."

"TIME_HOUR_SHORT"=" h "
"TIME_MIN_SHORT"=" min "
"TIME_SEC_SHORT1"=" sec"
"TIME_SEC_SHORT2"=" s"
"TIME_HOUR_FULL1"="st "
"TIME_HOUR_FULL2"="st "
"TIME_HOUR_FULL3"="st "
"TIME_MIN_FULL1"="min "
"TIME_MIN_FULL2"="min "
"TIME_MIN_FULL3"="min "
"TIME_SEC_FULL1"="sek "
"TIME_SEC_FULL2"="sek "
"TIME_SEC_FULL3"="sek "
"TIME_TYPE1"="Remain: "
"TIME_TYPE2"="Passed: "
"TIME_TYPE3"="Total: "
"TIME_TYPE4"="Wait "
"TIME_INFINITE"="Eternity"
"TIME_TEST"=""
"GENERAL_ENDING"=""
"GENERAL_DELETING"=""
"GENERAL_SCANNING"=""
